In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [7]:
dframe = DataFrame({'city' : ['Leh', 'Hikkim', 'Komic'],
                    'altitudes' : [3000, 3224, 2555]})

dframe

     city  altitudes
0     Leh       3000
1  Hikkim       3224
2   Komic       2555

In [8]:
state_map = {'Leh' : 'Ladakh', 'Hikkim' : 'Himachal Pradesh', 'Komic' : 'Himachal Pradesh'}

In [9]:
dframe['state'] = dframe['city'].map(state_map)

In [10]:
dframe

     city  altitudes             state
0     Leh       3000            Ladakh
1  Hikkim       3224  Himachal Pradesh
2   Komic       2555  Himachal Pradesh